bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY20.xml
                <register caption="MCU Control Register" name="MCUCR" offset="0x3A" size="1" mask="0xDF">
                    <bitfield caption="BOD Sleep" mask="0x10" name="BODS"/>
                    <bitfield caption="Sleep Mode" mask="0x0E" name="SM" values="CPU_SLEEP_MODE"/>
                    <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
                </register>
            </register-group>
            <value-group caption="Sleep Mode" name="CPU_SLEEP_MODE">
                <value caption="Idle" name="IDLE" value="0x00"/>
                <value caption="ADC noise reduction" name="ADC" value="0x01"/>
                <value caption="Power-down" name="PDOWN" value="0x02"/>
                <value caption="Standby" name="STDBY" value="0x04"/>
            </value-group>
            <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
                <value caption="256" name="VAL_0x08" value="0x08"/>
            </value-group>
            <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
                <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
            </value-group>

        </module>
        <module caption="External Interrupts" name="EXINT">
            <register-group caption="External Interrupts" name="EXINT">
                <register caption="MCU Control Register" name="MCUCR" offset="0x3A" size="1">
                    <bitfield caption="Interrupt Sense Control 0 Bit 1" mask="0x80" name="ISC01"/>
                    <bitfield caption="Interrupt Sense Control 0 Bit 0" mask="0x40" name="ISC00"
                              values="INTERRUPT_SENSE_CONTROL"/>
                </register>
                <register caption="Pin Change Mask Register 1" name="PCMSK1" offset="0x0A" size="1">
                    <bitfield caption="Pin Change Enable Masks" mask="0x0F" name="PCINT" lsb="8"/>
                </register>
                <register caption="Pin Change Mask Register 0" name="PCMSK0" offset="0x09" size="1">
                    <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT"/>
                </register>
                <register caption="General Interrupt Flag Register" name="GIFR" offset="0x0B" size="1">
                    <bitfield caption="Pin Change Interrupt Flags" mask="0x30" name="PCIF"/>
                    <bitfield caption="External Interrupt Flag 0" mask="0x01" name="INTF0"/>
                </register>
                <register caption="General Interrupt Mask Register" name="GIMSK" offset="0x0C" size="1">
                    <bitfield caption="Pin Change Interrupt Enables" mask="0x30" name="PCIE"/>
                    <bitfield caption="External Interrupt Request 0 Enable" mask="0x01" name="INT0"/>
                </register>
            </register-group>
            <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
                <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
                <value caption="Any logical change on INTX" name="VAL_0x01" value="0x01"/>
                <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
                <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 8-bit" name="TC8">
            <register-group caption="Timer/Counter, 8-bit" name="TC0">
                <register caption="Timer/Counter 0 Control Register A" name="TCCR0A" offset="0x19" size="1">
                    <bitfield caption="Compare Output Mode for Channel A bits" mask="0xC0" name="COM0A"/>
                    <bitfield caption="Compare Output Mode for Channel B bits" mask="0x30" name="COM0B"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM0"/>
                </register>
                <register caption="Timer/Counter 0 Control Register B" name="TCCR0B" offset="0x18" size="1">
                    <bitfield caption="Force Output Compare A" mask="0x80" name="FOC0A"/>
                    <bitfield caption="Force Output Compare B" mask="0x40" name="FOC0B"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x08" name="WGM02"/>
                    <bitfield caption="Clock Select" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer Interrupt Mask Register" name="TIMSK" offset="0x26" size="1">
                    <bitfield caption="Input Capture Interrupt Enable" mask="0x80" name="ICIE1"/>
                    <bitfield caption="Output Compare B Match Interrupt Enable" mask="0x20" name="OCIE1B"/>
                    <bitfield caption="Output Compare A Match Interrupt Enable" mask="0x10" name="OCIE1A"/>
                    <bitfield caption="Overflow Interrupt Enable" mask="0x09" name="TOIE"/>
                    <bitfield caption="Timer/Counter Output Compare Match B Interrupt Enable" mask="0x04"
                              name="OCIE0B"/>
                    <bitfield caption="Timer/Counter0 Output Compare Match A Interrupt Enable" mask="0x02"
                              name="OCIE0A"/>
                </register>
                <register caption="Overflow Interrupt Enable" name="TIFR" offset="0x25" size="1">
                    <bitfield caption="Input Capture Flag" mask="0x80" name="ICF1"/>
                    <bitfield caption="Timer Output Compare Flag 1B" mask="0x20" name="OCF1B"/>
                    <bitfield caption="Timer Output Compare Flag 1A" mask="0x10" name="OCF1A"/>
                    <bitfield caption="Timer Overflow Flag" mask="0x09" name="TOV"/>
                    <bitfield caption="Output Compare Flag 0 B" mask="0x04" name="OCF0B"/>
                    <bitfield caption="Output Compare Flag 0 A" mask="0x02" name="OCF0A"/>
                </register>
                <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x27" size="1">
                    <bitfield caption="Timer Synchronization Mode" mask="0x80" name="TSM"/>
                    <bitfield caption="Prescaler Reset" mask="0x01" name="PSR"/>
                </register>
                <register caption="Timer/Counter0" name="TCNT0" offset="0x17" size="1" mask="0xFF"/>
