bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY20.xml
                <register caption="Timer/Counter0 Output Compare Register" name="OCR0A" offset="0x16" size="1"
                          mask="0xFF"/>
                <register caption="Timer/Counter0 Output Compare Register" name="OCR0B" offset="0x15" size="1"
                          mask="0xFF"/>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Two Wire Serial Interface" name="TWI">
            <register-group caption="Two Wire Serial Interface" name="TWI">
                <register caption="TWI Slave Control Register A" name="TWSCRA" offset="0x2D" size="1">
                    <bitfield caption="TWI SDA Hold Time Enable" mask="0x80" name="TWSHE"/>
                    <bitfield caption="TWI Data Interrupt Enable" mask="0x20" name="TWDIE"/>
                    <bitfield caption="TWI Address/Stop Interrupt Enable" mask="0x10" name="TWASIE"/>
                    <bitfield caption="Two-Wire Interface Enable" mask="0x08" name="TWEN"/>
                    <bitfield caption="TWI Stop Interrupt Enable" mask="0x04" name="TWSIE"/>
                    <bitfield caption="TWI Promiscuous Mode Enable" mask="0x02" name="TWPME"/>
                    <bitfield caption="TWI Smart Mode Enable" mask="0x01" name="TWSME"/>
                </register>
                <register caption="TWI Slave Control Register B" name="TWSCRB" offset="0x2C" size="1">
                    <bitfield caption="TWI Acknowledge Action" mask="0x04" name="TWAA"/>
                    <bitfield caption="" mask="0x03" name="TWCMD"/>
                </register>
                <register caption="TWI Slave Status Register A" name="TWSSRA" offset="0x2B" size="1" mask="0xFF">
                    <bitfield caption="TWI Data Interrupt Flag" mask="0x80" name="TWDIF"/>
                    <bitfield caption="TWI Address/Stop Interrupt Flag" mask="0x40" name="TWASIF"/>
                    <bitfield caption="TWI Clock Hold" mask="0x20" name="TWCH"/>
                    <bitfield caption="TWI Receive Acknowledge" mask="0x10" name="TWRA"/>
                    <bitfield caption="TWI Collision" mask="0x08" name="TWC"/>
                    <bitfield caption="TWI Bus Error" mask="0x04" name="TWBE"/>
                    <bitfield caption="TWI Read/Write Direction" mask="0x02" name="TWDIR"/>
                    <bitfield caption="TWI Address or Stop" mask="0x01" name="TWAS"/>
                </register>
                <register caption="TWI Slave Address Register" name="TWSA" offset="0x2A" size="1" ocd-rw="R">
                    <bitfield caption="TWI slave address bit" mask="0xFF" name="TWSA"/>
                </register>
                <register caption="TWI Slave Data Register" name="TWSD" offset="0x28" size="1" ocd-rw="R">
                    <bitfield caption="TWI slave data bit" mask="0xFF" name="TWSD"/>
                </register>
                <register caption="TWI Slave Address Mask Register" name="TWSAM" offset="0x29" size="1" mask="0xFF"/>
            </register-group>
        </module>
        <module caption="Timer/Counter, 16-bit" name="TC16">
            <register-group caption="Timer/Counter, 16-bit" name="TC1">
                <register caption="Timer/Counter1 Control Register A" name="TCCR1A" offset="0x24" size="1">
                    <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM1A"/>
                    <bitfield caption="Compare Output Mode 1B, bits" mask="0x30" name="COM1B"/>
                    <bitfield caption="Waveform Generation Mode Bits" mask="0x03" name="WGM1"/>
                </register>
                <register caption="Timer/Counter1 Control Register B" name="TCCR1B" offset="0x23" size="1">
                    <bitfield caption="Input Capture 1 Noise Canceler" mask="0x80" name="ICNC1"/>
                    <bitfield caption="Input Capture 1 Edge Select" mask="0x40" name="ICES1"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM1" lsb="2"/>
                    <bitfield caption="Clock Select1 bits" mask="0x07" name="CS1" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter1 Control Register C" name="TCCR1C" offset="0x22" size="1">
                    <bitfield caption="Force Output Compare for channel A" mask="0x80" name="FOC1A"/>
                    <bitfield caption="Force Output Compare for channel B" mask="0x40" name="FOC1B"/>
                </register>
                <register caption="Timer/Counter1 " name="TCNT1" offset="0x20" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter 1 Output Compare Register A " name="OCR1A" offset="0x1E" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter1 Output Compare Register B " name="OCR1B" offset="0x1C" size="2"
                          mask="0xFFFF"/>
                <register caption="Input Capture Register  Bytes" name="ICR1" offset="0x1A" size="2" mask="0xFFFF"/>
                <register caption="Timer Interrupt Mask Register" name="TIMSK" offset="0x26" size="1">
                    <bitfield caption="Input Capture Interrupt Enable" mask="0x80" name="ICIE1"/>
                    <bitfield caption="Output Compare B Match Interrupt Enable" mask="0x20" name="OCIE1B"/>
                    <bitfield caption="Output Compare A Match Interrupt Enable" mask="0x10" name="OCIE1A"/>
                    <bitfield caption="Overflow Interrupt Enable" mask="0x09" name="TOIE"/>
                    <bitfield caption="Timer/Counter Output Compare Match B Interrupt Enable" mask="0x04"
                              name="OCIE0B"/>
                    <bitfield caption="Timer/Counter0 Output Compare Match A Interrupt Enable" mask="0x02"
                              name="OCIE0A"/>
                </register>
                <register caption="Overflow Interrupt Enable" name="TIFR" offset="0x25" size="1">
                    <bitfield caption="Input Capture Flag" mask="0x80" name="ICF1"/>
                    <bitfield caption="Timer Output Compare Flag 1B" mask="0x20" name="OCF1B"/>
                    <bitfield caption="Timer Output Compare Flag 1A" mask="0x10" name="OCF1A"/>
                    <bitfield caption="Timer Overflow Flag" mask="0x09" name="TOV"/>
                    <bitfield caption="Output Compare Flag 0 B" mask="0x04" name="OCF0B"/>
                    <bitfield caption="Output Compare Flag 0 A" mask="0x02" name="OCF0A"/>
                </register>
                <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x27" size="1">
                    <bitfield caption="Timer Synchronization Mode" mask="0x80" name="TSM"/>
                    <bitfield caption="Prescaler Reset" mask="0x01" name="PSR"/>
                </register>
            </register-group>
