bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY20.xml
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Serial Peripheral Interface" name="SPI">
            <register-group caption="Serial Peripheral Interface" name="SPI">
                <register caption="SPI Control Register" name="SPCR" offset="0x30" size="1">
                    <bitfield caption="SPI Interrupt Enable" mask="0x80" name="SPIE"/>
                    <bitfield caption="SPI Enable" mask="0x40" name="SPE"/>
                    <bitfield caption="Data Order" mask="0x20" name="DORD"/>
                    <bitfield caption="Master/Slave Select" mask="0x10" name="MSTR"/>
                    <bitfield caption="Clock polarity" mask="0x08" name="CPOL"/>
                    <bitfield caption="Clock Phase" mask="0x04" name="CPHA"/>
                    <bitfield caption="SPI Clock Rate Selects" mask="0x03" name="SPR" values="COMM_SCK_RATE"/>
                </register>
                <register caption="SPI Status Register" name="SPSR" offset="0x2F" size="1">
                    <bitfield caption="SPI Interrupt Flag" mask="0x80" name="SPIF"/>
                    <bitfield caption="Write Collision Flag" mask="0x40" name="WCOL"/>
                    <bitfield caption="Double SPI Speed Bit" mask="0x01" name="SPI2X"/>
                </register>
                <register caption="SPI Data Register" name="SPDR" offset="0x2E" size="1" mask="0xFF"/>
            </register-group>
            <value-group caption="" name="COMM_SCK_RATE">
                <value caption="fcl/4" name="VAL_0x00" value="0x00"/>
                <value caption="fcl/16" name="VAL_0x01" value="0x01"/>
                <value caption="fcl/64" name="VAL_0x02" value="0x02"/>
                <value caption="fcl/128" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="DIP">
            <pin pad="VCC" position="1"/>
            <pin pad="PB0" position="2"/>
            <pin pad="PB1" position="3"/>
            <pin pad="PB3" position="4"/>
            <pin pad="PB2" position="5"/>
            <pin pad="PA7" position="6"/>
            <pin pad="PA6" position="7"/>
            <pin pad="PA5" position="8"/>
            <pin pad="PA4" position="9"/>
            <pin pad="PA3" position="10"/>
            <pin pad="PA2" position="11"/>
            <pin pad="PA1" position="12"/>
            <pin pad="PA0" position="13"/>
            <pin pad="GND" position="14"/>
        </pinout>
        <pinout name="VQFN">
            <pin pad="PA4" position="1"/>
            <pin pad="PA3" position="2"/>
            <pin pad="PA2" position="3"/>
            <pin pad="PA1" position="4"/>
            <pin pad="PA0" position="5"/>
            <pin pad="GND" position="8"/>
            <pin pad="VCC" position="9"/>
            <pin pad="PB0" position="11"/>
            <pin pad="PB1" position="12"/>
            <pin pad="PB3" position="13"/>
            <pin pad="PB2" position="14"/>
            <pin pad="PA7" position="15"/>
            <pin pad="PA6" position="16"/>
            <pin pad="PA5" position="17"/>
        </pinout>
        <pinout name="UFBGA">
            <pin pad="PA4" position="B1"/>
            <pin pad="PA3" position="C1"/>
            <pin pad="PA0" position="D1"/>
            <pin pad="PA5" position="A2"/>
            <pin pad="PA7" position="B2"/>
            <pin pad="PA2" position="C2"/>
            <pin pad="GND" position="D2"/>
            <pin pad="PA6" position="A3"/>
            <pin pad="PB1" position="B3"/>
            <pin pad="PA1" position="C3"/>
            <pin pad="GND" position="D3"/>
            <pin pad="PB2" position="A4"/>
            <pin pad="PB3" position="B4"/>
            <pin pad="PB0" position="C4"/>
            <pin pad="VCC" position="D4"/>
        </pinout>
        <pinout name="WLCSP">
            <pin pad="PA4" position="A1"/>
            <pin pad="PA1" position="A3"/>
            <pin pad="PA2" position="A5"/>
            <pin pad="PA6" position="B2"/>
            <pin pad="GND" position="B4"/>
            <pin pad="VDD" position="B6"/>
            <pin pad="PA5" position="C1"/>
            <pin pad="PA7" position="C3"/>
            <pin pad="PB1" position="C5"/>
            <pin pad="PB2" position="D2"/>
            <pin pad="PB3" position="D4"/>
            <pin pad="PB0" position="D6"/>
        </pinout>
    </pinouts>
</target-description-file>
